{
  "message": "hello i18n !!",
  "PROJECTINFO_ADD_MESSAGE": "ProjectInfo  added successfully",
  "PROJECTINFO_UPDATE_MESSAGE": "ProjectInfo Updated successfully",
  "PROJECTINFO_DELETE_MESSAGE": "ProjectInfo  Deleted successfully",
  "TECHNICALREQ_ADD_MESSAGE": "TechnicalReq  added successfully",
  "TECHNICALREQ_UPDATE_MESSAGE": "TechnicalReq Updated successfully",
  "TECHNICALREQ_DELETE_MESSAGE": "TechnicalReq  Deleted successfully",
  "PACKAGE_ADD_MESSAGE": "Package  added successfully",
  "PACKAGE_UPDATE_MESSAGE": "Package Updated successfully",
  "PACKAGE_DELETE_MESSAGE": "Package  Deleted successfully",
  "main": {
    "siteTitle": "BC Services Card Self Service",
    "loading": "Thank you for your patience<br />as we fulfill your request."
  },
  "projectInfo": {
    "ProjectInfoTitle": "Project Information",
    "ProjectInfoTitleInfo": "<p>To receive access to the BC Services Card login API to use with your web application, we need to gather some information about the application you’re working with.  </p><p>  Collecting this information allows us to understand the purpose of your application or project within your organization and provide proper assistance to you as you move through from development to the live access request. </p>",
    "ProjectOrgTitle": "This API is available for organizations that fall within the BC Broader Public Sector (BPS).",
    "OrganizationName": "Organization name",
    "projectName": "Project name",
    "Description": "Description",

    "ProjectRoles": "Project Roles",
    "RolesTitleInfo": "In this system, a project consists of one (or more) Developer(s), a Manager and an Executive sponsor. Please provide contact information for each of these roles within your organization in the context of this project.",
    "myRole": "My role in this project is:",
    "ForProject": "for this project",
    "ManagerRole": "Manager",
    "CTORole": "Executive Sponsor",
    "DeveloperRole": "Developer",
    "btnNext": "Next",
    "btnSaveChanges": "Save Changes",
    "btnCancel": "Cancel",
    "OrganizationNameHint": "BC Services Card login is available to many Public Sector agencies. Please let us know which one you are affiliated with.",
    "projectNameHint": "Please provide us with a short name of your application which will create a login option with the BC Services Card",
    "DescriptionHint": "Please provide us with a short description of your application and why you need the BC Services Card as a login method",
    "developerHint": "Please provide developer’s contact information who is associated to this request and project. This is a person who understand OIDC and will be able to configure your BPS application for the BC Services Card Login",
    "managerHint": "Please provide managers contact information who is associated to this request and project. This is a person who will be the main point of contact for the BC Services Card IDIM team and provide updates on the project’s privacy, security, communication and agreement progress.",
    "ctoHint": "Please provide Executive Sponsor’s contact information who is associated to this request and project. This is a person who will provide attestations to the BC Services Card IDIM team on the compliance and completion of privacy, security, communication and agreement items."
  },
  "technicalRequirements": {
    "technicalTitle": "Technical Requirements",
    "technicalTitleInfo": "The authentication process with BC Services Card is through Open ID Connect (OIDC). The following parameters are required for us to initiate the connection.",
    "projectName": "Project name:",
    "inputAppText": "Add the URL of your application home page, or where users will go to understand what your application does.",
    "inputUrlText": "Input the URL(s) of your redirect location(s). These are potential URL addresses to which we could redirect your application on successful user authentication. If you have multiple redirects, use one field for each URL.",
    "labelApplicationUrl": "Home page URL",
    "labelRedirectUrl": "Redirect URI values",
    "JWKSText": "Input the URL to your JSON Web Key Set (JWKS). The BC Services Card implementation of OIDC requires you to implement a URL from which your JWKS can be obtained. You also need to tell us which cryptographic algorithms we should use for ID tokens and user information signed responses. (default is RS256).",
    "labelJWKSUrl": "JSON Web Key Set (JWKS) URL",
    "labelEncryptedResponseAlg": "Encryption Algorithm",
    "labelSignedResponseAlg": "Signature Algorithm",
    "labelEncryptedResponseAlgHint": " This is the algorithm you would like us to use for encrypting the returned JWT.",
    "labelSignedResponseAlgHint": "This is the algorithm you would like us to use for signing the returned JWT. We sign with our private key, our public key is included in the token.",
    "btnBack": "Go Back",
    "btnNext": "Next",
    "btnCancel": "Cancel",
    "btnSaveChanges": "Save Changes",
    "labelTestMethod": "Select your testing method",
    "labelTestMethodHint": "Select your testing method hint"
  },
  "selectPackage": {
    "pagetitle": "Select Package",
    "pagetitleInfo": "<p>OIDC scopes are collections of user attributes which can be returned on successful authentication.</p>Select the most appropriate package of scopes for your use case, noting that the more attributes you require, the greater the overhead of complying with privacy regulations.</p><p><br /></p><p>The following standard scopes are supported :</p><p><ul ><li class='my-1'>openid - Unique identifier </li><li class='my-1'>profile - Given name and surname</li><li class='my-1'>email - Email address</li><li class='my-1'>address - Physical address (Street, locality, state or province, postal code and country) </li></ul></p>",
    "choosePackage": "Select your scope package",
    "description": "This package contains the following data:",
    "package1": "Package 1 - best fit for organizations looking for a digital signature",
    "package2": "Package 2 - best fit for organizations who want to know who the user is and communicate directly with their users electronically",
    "package3": "Package 3 - best fit for organizations who want to know who the user is and communicate directly with their users non-electronically",
    "how_many_test_account": "How many test accounts do you require?",
    "special_notes": "Special requests or notes for test account creation",
    "btnBack": "Go Back",
    "btnNext": "Next",
    "btnCancel": "Cancel",
    "btnSaveChanges": "Save Changes"
  },
  "testAccount": {
    "pagetitle": "Test Accounts",
    "pageinfo": "In order to test your configuration, we would like to know how many test accounts you need for {package}. Please note the test data provided to you will be randomized unless you indicate you have preferred customization. If you select the randomized test account, you can expect the test accounts immediately or within X days.",
    "how_many_test_account": "Choose the number of test user accounts you require",
    "special_notes": "Special requests or notes",
    "specialNotesInfo": "<p>If you have any special requests regarding the data contained in these test accounts, please include that information in this space.</p></p>(For example: all users must have a different city in the address block)</p>",
    "btnBack": "Go Back",
    "btnNext": "Next",
    "btnCancel": "Cancel",
    "btnSaveChanges": "Save Changes"
  },
  "summaryPage": {
    "pagetitle": "Summary",
    "subTitle": "<p>The details you entered are shown as a summary on this page. Please review the information to ensure that it is correct before submitting your request with the “Submit Request” button.</p><p><br /></p><p>If you need to make changes at this stage, you can edit the sections using the edit icons on this page.</p>",
    "projectInfoTitle": "Project Information",
    "labelProjectTitle": "Project name",
    "labelOrganizationName": "Organization name",
    "labelTechnicalContact": "Developer",
    "labelManagerContact": "Manager ",
    "labelCtoContact": "Executive Sponsor",
    "Next": "Next",
    "Back": "Go Back",
    "technicalReqTitle": "Technical Requirement",
    "labelApplicationUrl": "Application URL",
    "labelRedirectUrl": "Redirect URL values",
    "labelJWKSUrl": "JSON Web Key Set (JWKS) URL",
    "labelEncryptedResponseAlg": "Encryption Algorithm",
    "labelSignedResponseAlg": "Signature Algorithm",
    "packageTestTitle": "Data Scopes",
    "labelDataPackageReqd": "Data package requested",
    "labelTestAccounts": "Test accounts",
    "labelSpecialReq": "Special request",
    "labelTestAccountNumber": "Accounts requested",
    "submitRequest": "Submit Request",
    "goBack": "Go Back",
    "disclaimerTitle": "Disclaimer",
    "disclaimerContent": "<h4>Warranty Disclaimer</h4><p></p><p>This information is provided as a public service by the Government of British Columbia, Box 9411, Victoria, British Columbia, Canada V8W 9V1.</p><p>This website and all of the information it contains are provided 'as is' without warranty of any kind, whether express or implied. All implied warranties, including, without limitation, implied warranties of merchantability, fitness for a particular purpose, and non-infringement, are hereby expressly disclaimed. Links and references to any other websites are provided for information only and listing shall not be taken as endorsement of any kind. The Government of British Columbia is not responsible for the content or reliability of the linked websites and does not endorse the content, products, services or views expressed within them.</p><h4>Limitation of Liabilities</h4><p>Under no circumstances will the Government of British Columbia be liable to any person or business entity for any direct, indirect, special, incidental, consequential, or other damages based on any use of this website or any other website to which this site is linked, including, without limitation, any lost profits, business interruption, or loss of programs or information, even if the Government of British Columbia has been specifically advised of the possibility of such damages.</p>",
    "btnAgree": "Agree & Continue",
    "btnAgreeBack": "Cancel",
    "labelTestAccountsTitle": "Test Accounts",
    "cantSubmitErrorMessage": "Your submission contains incomplete fields. Please edit any sections requiring completion before submitting your request.",
    "systemError": "Something went wrong while processing your request. Please retry in a few minutes. If the problem persists, please contact the Product Owner.",
    "OrganizationNameHint": "This is the name of the Public Sector agency with which you are affiliated.",
    "projectNameHint": "Please provide us with a short name of your application which will create a login option with the BC Services Card",
    "developerHint": "This is a person who understand OIDC and will be able to configure your BPS application for the BC Services Card Login",
    "managerHint": "This is a person who will be the main point of contact for the BC Services Card IDIM team and provide updates on the project’s privacy, security, communication and agreement progress.",
    "ctoHint": "This is a person who will provide attestations to the BC Services Card IDIM team on the compliance and completion of privacy, security, communication and agreement items.",
    "applicationUrlHint": "This is your application home page, or where users will go to use your application.",
    "labelRedirectUrlHint": "These are potential URL addresses to which we could redirect your application on successful user authentication. If you have multiple redirects, use one field for each URL.",
    "labelJWKSUrlHint": "We use your JWKS  public key to encrypt our returned JWT. Warning - If the JWKS does not resolve, the JWT will not be encrypted.",
    "labelEncryptedResponseAlgHint": "This is the algorithm you would like us to use for encrypting the returned JWT. ",
    "labelSignedResponseAlgHint": "This is the algorithm you would like us to use for signing the returned JWT. We sign with our private key, our public key is included in the token.",
    "labelDataPackageReqdHint": "Package of OIDC scopes (or user attributes) made available to your application on successful login"
  },
  "ClientID": {
    "pagetitle": "API Key / Client ID",
    "titleApiKey": "Client ID",
    "titleApiKeyInfo": "This is a unique identifier for your project. Any request to access the BC Services Card system must have this to identify your application.",
    "titleClientSecret": "Client secret",
    "titleClientSecretInfo": "This is a secret or password which is to be used together with the Client ID to obtain a token from the BC Services Card system for ongoing authorization.",
    "titleTestAccount": "Test user accounts",
    "titleTestAccountInfo": "<p>These are account numbers with associated passphrases which can be used as test logins to the BC Services Card.The test accounts are provided in the format of ID #, ID key</p><p><a href='https://www2.gov.bc.ca/gov/content/governments/services-for-government/information-management-technology/identity-and-authentication-services/bc-services-card-authentication-service/design-develop-test/testing' target='_blank'>Learn more</a></p>",
    "labelSnackbarClose": "Close",
    "Back": "Go Back",
    "tblCardNo": "Card Number",
    "tblPassCode": "Passcode",
    "tblGivenName": "Given Name",
    "tblSurName": "Surname"
  },
  "dashboard": {
    "pagetitle": "Projects",
    "tblTitleSi": "#",
    "tblTitleProjectName": "Project name",
    "tblTitleProjectId": "ID",
    "tblTitlCreated": "Created",
    "tblTitleProjectStatus": "Project status",
    "tblTitleProjectActions": "Actions",
    "tblTitlrole": "Role",
    "noData": "There are no projects to view. Add one to start "
  },
  "profile": {
    "pagetitle": "Complete Profile",
    "titlePageInfo": "After you add your contact information, you will receive a confirmation email. Only users from the broader public sector or BC Government will be approved for access.",
    "labelEmail": "Email (work)",
    "labelPhone": "Phone",
    "btnContinue": "Continue",
    "errorMessageDomain": "Your email address does not match any of the eligible organizations in our BC Services Card Self Service System. If you believe you or your organization should have access to this system, please contact <a href='mailto:zorin.samji@gov.bc.ca'>IDIM Consulting</a> to be added. "
  },
  "home": {
    "pagetitle": "Complete Profile",
    "txtMainTitle": "Easily implement BC Services Card for online authentication",
    "txtFitForOrganization": "Is this a fit for your organization?",
    "txtsubcontent1": "Do you want to use <a href='https://digital.gov.bc.ca' target='_ss'>digital technologies</a> that are transforming the way British Columbians live, work and play?",
    "txtsubcontent2": "Are you part of a Broader Public Sector organization?",
    "txtsubcontent3": "Is your organization in need of <a href='https://www2.gov.bc.ca/assets/gov/government/services-for-government-and-broader-public-sector/information-technology-services/standards-files/identity_assurance_standard.pdf' target='_ss' >high assurance authentication?</a>",
    "txtsubTitle2": "What defines \"broader public sector\"?",
    "txtsubcontent4": "Broader Public Sector includes the core provincial public service (ministries), health authorities, Crown corporations, K-12 schools, colleges, institutes, teaching universities, and research universities, contracted social service providers. It does not include Federal, local and municipal governments.",
    "btnLearmore": "Learn more",
    "txtgetStarted": "Get started"
  },
  "testAccountList": {
    "pagetitle": "Add Test Accounts",
    "pageinfo": "Some text for add test account",
    "special_notes": "Past your test accounts without heading",
    "btnBack": "Go Back",
    "btnSaveChanges": "Add Test Account",
    "errorMessage": "Something went wrong.",
    "successMessage": "Test Account created"
  }
}
