{
  "message": "hello i18n !!",
  "PROJECTINFO_ADD_MESSAGE": "ProjectInfo  added successfully",
  "PROJECTINFO_UPDATE_MESSAGE": "ProjectInfo Updated successfully",
  "PROJECTINFO_DELETE_MESSAGE": "ProjectInfo  Deleted successfully",
  "TECHNICALREQ_ADD_MESSAGE": "TechnicalReq  added successfully",
  "TECHNICALREQ_UPDATE_MESSAGE": "TechnicalReq Updated successfully",
  "TECHNICALREQ_DELETE_MESSAGE": "TechnicalReq  Deleted successfully",
  "PACKAGE_ADD_MESSAGE": "Package  added successfully",
  "PACKAGE_UPDATE_MESSAGE": "Package Updated successfully",
  "PACKAGE_DELETE_MESSAGE": "Package  Deleted successfully",
  "main": {
    "siteTitle": "BC Services Card Self Service",
    "loading": "Thank you for your patience<br />as we fulfill your request."
  },
  "projectInfo": {
    "ProjectInfoTitle": "Project Information",
    "ProjectInfoTitleInfo": "<p class='pageinfo'>To receive access to the BC Services Card login API , we need to gather some information about the application you’re working with. This allows us to understand the purpose of your application or project within your organization and provide proper assistance to you, through development to the live access request.</p>",
    "ProjectOrgTitle": "This API is available for organizations that fall within the BC Broader Public Sector (BPS).",
    "OrganizationName": "Organization name",
    "projectName": "Project name",
    "Description": "Description",
    "ProjectRoles": "Project Roles",
    "RolesTitleInfo": "In this system, a project consists of one (or more) Developer(s), a Manager and an Executive sponsor. Please provide contact information for each of these roles within your organization in the context of this project.",
    "myRole": "My role in this project is:",
    "ForProject": "for this project",
    "ManagerRole": "Manager",
    "CTORole": "Executive Sponsor",
    "DeveloperRole": "Developer",
    "btnNext": "Next",
    "btnSaveChanges": "Save Changes",
    "btnCancel": "Cancel",
    "OrganizationNameHint": "BC Services Card login is available to many Public Sector agencies. Please let us know which one you are affiliated with.",
    "projectNameHint": "Please provide us with a short name of your application which will create a login option with the BC Services Card",
    "DescriptionHint": "Please provide us with a short description of your application and why you need the BC Services Card as a login method",
    "developerHint": "Please provide developer’s contact information who is associated to this request and project. This is a person who understand OIDC and will be able to configure your BPS application for the BC Services Card Login",
    "managerHint": "Please provide managers contact information who is associated to this request and project. This is a person who will be the main point of contact for the BC Services Card IDIM team and provide updates on the project’s privacy, security, communication and agreement progress.",
    "ctoHint": "Please provide Executive Sponsor’s contact information who is associated to this request and project. This is a person who will provide attestations to the BC Services Card IDIM team on the compliance and completion of privacy, security, communication and agreement items."
  },
  "technicalRequirements": {
    "technicalTitle": "Technical Requirements",
    "technicalTitleInfo": "<p class='pageinfo'>The authentication process with BC Services Card is through Open ID Connect (OIDC). The following parameters are required for us to initiate the connection.</p>",
    "projectName": "Project name:",
    "inputAppText": "Add the URL of your application home page, or where users will go to understand what your application does.",
    "inputUrlText": "Input the URL(s) of your redirect location(s). These are potential URL addresses to which we could redirect your application on successful user authentication. If you have multiple redirects, use one field for each URL.",
    "labelApplicationUrl": "Home page URL",
    "labelRedirectUrl": "Redirect URI values",
    "JWKSText": "Input the URL to your JSON Web Key Set (JWKS). The BC Services Card implementation of OIDC requires you to implement a URL from which your JWKS can be obtained. You also need to tell us which cryptographic algorithms we should use for ID tokens and user information signed responses. (default is RS256).",
    "labelJWKSUrl": "JSON Web Key Set (JWKS) URL",
    "labelEncryptedResponseEnc": "Encryption Encoding",
    "labelEncryptedResponseAlg": "Encryption Algorithm",
    "labelSignedResponseAlg": "Signature Algorithm",
    "labelEncryptedResponseEncHint": "This is the encryption encoding algorithm you would like us to use for the returned JWT.",
    "labelEncryptedResponseAlgHint": "This is the algorithm you would like us to use for encrypting the returned JWT.",
    "labelSignedResponseAlgHint": "This is the algorithm you would like us to use for signing the returned JWT. We sign with our private key, our public key is included in the token.",
    "btnBack": "Go Back",
    "btnNext": "Next",
    "btnCancel": "Cancel",
    "btnSaveChanges": "Save Changes",
    "labelTestMethod": "Select your data security and format",
    "labelTestMethodHint": "Choose your signing and encryption methods for testing below. These options are available to facilitate your testing. Please note that when you move into a production environment, it will be required that you enable signing and encryption at that time.",
    "SignedJWTHint": "We return a signed JWT for more security",
    "SecureJWTHint": "We return a signed and encrypted JWT for maximum security",
    "AddURI": "+ Add another URI"
  },
  "selectPackage": {
    "pagetitle": "Select Package",
    "pagetitleInfo": "<p class='pageinfo'>OIDC scopes are collections of user attributes which can be returned on successful authentication.</p>Select the most appropriate package of scopes for your use case, noting that the more attributes you require, the greater the overhead of complying with privacy regulations.</p><p><br /></p><p>The following standard scopes are supported :</p><p><ul ><li class='my-1'>openid - Unique identifier </li><li class='my-1'>profile - Given name and surname</li><li class='my-1'>email - Email address</li><li class='my-1'>address - Physical address (Street, locality, state or province, postal code and country) </li></ul></p>",
    "choosePackage": "Select your scope package",
    "description": "This package contains the following data:",
    "package1": "Package 1 - best fit for organizations looking for a digital signature",
    "package2": "Package 2 - best fit for organizations who want to know who the user is and communicate directly with their users electronically",
    "package3": "Package 3 - best fit for organizations who want to know who the user is and communicate directly with their users non-electronically",
    "how_many_test_account": "How many test accounts do you require?",
    "special_notes": "Special requests or notes for test account creation",
    "btnBack": "Go Back",
    "btnNext": "Next",
    "btnCancel": "Cancel",
    "btnSaveChanges": "Save Changes"
  },
  "team": {
    "pageTitle": "Team",
    "btnBack": "Go Back",
    "btnNext": "Next",
    "btnCancel": "Cancel",
    "btnSaveChanges": "Save Changes"
  },
  "testAccount": {
    "pagetitle": "Test Accounts",
    "pageinfo": "<p class='pageinfo'>In order to test your configuration, we would like to know how many test accounts you need for package. Please note the test data provided to you will be randomized unless you indicate you have preferred customization.</p>",
    "how_many_test_account": "Choose the number of test user accounts you require",
    "special_notes": "Special requests or notes",
    "specialNotesInfo": "<p>If you have any special requests for customized test account. Please contact IDIM Consulting or <a href='mailto:zorin.samji@gov.bc.ca'>Product Owner</a>.</p>",
    "btnBack": "Go Back",
    "btnNext": "Next",
    "btnCancel": "Cancel",
    "btnSaveChanges": "Save Changes"
  },
  "summaryPage": {
    "pagetitle": "Summary",
    "subTitle": "<p class='pageinfo mb-2'>This page is a summary of the details of your development request. </p><p class='normal'><strong>Please note any changes will not be reflected until you submit/commit changes.</strong></p>",
    "createSuccessMessage": "Your request was successfully received",
    "updateSuccessMessage": "Your changes are successfully committed",
    "projectInfoTitle": "Project Information",
    "labelProjectTitle": "Project name",
    "labelOrganizationName": "Organization name",
    "developer": "Developer",
    "manager": "Manager ",
    "cto": "Executive Sponsor",
    "Next": "Next",
    "Back": "Go Back",
    "technicalReqTitle": "Technical Requirement",
    "labelApplicationUrl": "Application URL",
    "labelRedirectUrl": "Redirect URL values",
    "labelJWKSUrl": "JSON Web Key Set (JWKS) URL",
    "labelEncryptedResponseEnc": "Encryption Encoding",
    "labelEncryptedResponseAlg": "Encryption Algorithm",
    "labelSignedResponseAlg": "Signature Algorithm",
    "packageTestTitle": "Data Scopes",
    "labelDataPackageReqd": "Data package requested",
    "labelTestAccounts": "Test accounts",
    "labelSpecialReq": "Special request",
    "labelTestAccountNumber": "Accounts requested",
    "submitRequest": "Submit Request",
    "commitChanges": "Commit Changes",
    "goBack": "Go Back",
    "disclaimerTitle": "Disclaimer",
    "disclaimerContent": "<h4>Warranty Disclaimer</h4><p></p><p>This information is provided as a public service by the Government of British Columbia, Box 9411, Victoria, British Columbia, Canada V8W 9V1.</p><p>This website and all of the information it contains are provided 'as is' without warranty of any kind, whether express or implied. All implied warranties, including, without limitation, implied warranties of merchantability, fitness for a particular purpose, and non-infringement, are hereby expressly disclaimed. Links and references to any other websites are provided for information only and listing shall not be taken as endorsement of any kind. The Government of British Columbia is not responsible for the content or reliability of the linked websites and does not endorse the content, products, services or views expressed within them.</p><h4>Limitation of Liabilities</h4><p>Under no circumstances will the Government of British Columbia be liable to any person or business entity for any direct, indirect, special, incidental, consequential, or other damages based on any use of this website or any other website to which this site is linked, including, without limitation, any lost profits, business interruption, or loss of programs or information, even if the Government of British Columbia has been specifically advised of the possibility of such damages.</p>",
    "btnAgree": "Agree & Continue",
    "btnAgreeBack": "Cancel",
    "labelTestAccountsTitle": "Test Accounts",
    "cantSubmitErrorMessage": "Your submission contains incomplete fields. Please edit any sections requiring completion before submitting your request.",
    "systemError": "Something went wrong while processing your request. Please retry in a few minutes. If the problem persists, please contact the Product Owner.",
    "OrganizationNameHint": "This is the name of the Public Sector agency with which you are affiliated.",
    "projectNameHint": "Please provide us with a short name of your application which will create a login option with the BC Services Card",
    "developerHint": "The developer builds the integration with BC Services Card",
    "managerHint": " The manager steers the integration through to production",
    "ctoHint": "The Executive Sponsor attests to the integration application compliance",
    "applicationUrlHint": "This is your application home page, or where users will go to use your application.",
    "labelRedirectUrlHint": "These are potential URL addresses to which we could redirect your application on successful user authentication. If you have multiple redirects, use one field for each URL.",
    "labelJWKSUrlHint": "We use your JWKS  public key to encrypt our returned JWT. Warning - If the JWKS does not resolve, the JWT will not be encrypted.",
    "labelEncryptedResponseEncHint": "This is the encryption encoding algorithm you would like us to use for the returned JWT.",
    "labelEncryptedResponseAlgHint": "This is the algorithm you would like us to use for encrypting the returned JWT.",
    "labelSignedResponseAlgHint": "This is the algorithm you would like us to use for signing the returned JWT. We sign with our private key, our public key is included in the token.",
    "labelDataPackageReqdHint": "Package of OIDC scopes (or user attributes) made available to your application on successful login",
    "labelTestingMethod": "Testing Method",
    "labelTestingMethodHint": "This is the method you chose for testing in development. Please note that a production environment will require signing and encryption.",
    "SignedJWT": "Signed JWT",
    "SecureJWT": "Secure JWT",
    "teamTitle": "Team"
  },
  "ClientID": {
    "pagetitle": "API Key / Client ID",
    "titleApiKey": "Client ID",
    "titleApiKeyInfo": "This is a unique identifier for your project. Any request to access the BC Services Card system must have this to identify your application.",
    "titleClientSecret": "Client secret",
    "titleClientSecretInfo": "This is a secret or password which is to be used together with the Client ID to obtain a token from the BC Services Card system for ongoing authorization.",
    "titleTestAccount": "Test user accounts",
    "titleTestAccountInfo": "<p class='small-hint'>These are account numbers with associated passphrases which can be used as test logins to the BC Services Card.The test accounts are provided in the format of ID #, ID key</p><p><a href='https://www2.gov.bc.ca/gov/content/governments/services-for-government/information-management-technology/identity-and-authentication-services/bc-services-card-authentication-service/design-develop-test/testing' target='_blank'>Learn more</a></p>",
    "labelSnackbarClose": "Close",
    "Back": "Go Back",
    "tblCardNo": "Card Number",
    "tblPassCode": "Passcode",
    "tblGivenName": "Given Name",
    "tblSurName": "Surname",
    "warningLimitedTestAccount": "There are no more test accounts for use. Please <a href='/contact-us'>contact us</a> for assistance.",
    "tooltipTestAccount": "If there is a mismatch between the number of test accounts you requested and what you see here, <br/>then there are no more random test accounts for your use. <br/>Please contact IDIM Consulting or Product Owner who will be in touch with you shortly."
  },
  "dashboard": {
    "pagetitle": "Projects",
    "tblTitleSi": "#",
    "tblTitleProjectName": "Project name",
    "tblTitleReferenceNo": "Reference number",
    "tblTitlCreated": "Created",
    "tblTitleProjectStatus": "Project status",
    "tblTitleProjectActions": "Actions",
    "tblTitlrole": "My role",
    "noData": "There are no projects to view. Add one to start ",
    "roledraft": "Draft",
    "roledevelopment": "Development",
    "roledevelopmentComplete": "Development Complete",
    "rolecomplianceChecks": "Compliance checks",
    "roleawaitingApproval": "Awaiting approval",
    "roleawaitingStagingKeys": "Awaiting staging keys",
    "roleawaitingProductionUse": "Awaiting production use",
    "rolereadyForFirstCitizenUse": "Ready for first citizen use"
  },
  "profile": {
    "pageTitle": "Profile",
    "pageCompleteTitle": "Complete Profile",
    "titlePageInfoBCSC": "<p>Thank you for logging in with your BC Services Card. Please provide us with your Broader Public Sector agency work email address and phone number.</p><p>It should be noted all information collected is in a business context for business contact use only. Under the Freedom of Information and Protection of Privacy Act (FOIPPA), business contact information it is not considered Personal Information (PI). Please <a href='/contact-us'>contact us</a> with any questions.</p>",
    "titlePageInfoIDIR": "<p>Thank you for logging in with your IDIR, which provides us with your work email address. Please provide us with your phone number.</p><p>It should be noted all information collected is in a business context for business contact use only. Under the Freedom of Information and Protection of Privacy Act (FOIPPA), business contact information it is not considered Personal Information (PI). Please <a href='/contact-us'>contact us</a> with any questions. </p>",
    "titlePageCompleteInfo": "You can edit the following fields related to your profile",
    "labelEmail": "Email (work)",
    "labelPhone": "Phone",
    "btnContinue": "Continue",
    "btnSaveChanges": "Save Changes",
    "errorMessageDomain": "Your email address does not match any of the eligible organizations in our BC Services Card Self Service System. If you believe you or your organization should have access to this system, please <a href='mailto:zorin.samji@gov.bc.ca'>contact us</a> for assistance. "
  },
  "home": {
    "pagetitle": "Complete Profile",
    "txtMainTitle": "Easily implement BC Services Card for online authentication",
    "txtFitForOrganization": "Is this a fit for your organization?",
    "txtsubcontent1": "Do you want to use <a href='https://digital.gov.bc.ca' target='_ss'>digital technologies</a> that are transforming the way British Columbians live, work and play?",
    "txtsubcontent2": "Are you part of a Broader Public Sector organization?",
    "txtsubcontent3": "Is your organization in need of <a href='https://www2.gov.bc.ca/assets/gov/government/services-for-government-and-broader-public-sector/information-technology-services/standards-files/identity_assurance_standard.pdf' target='_ss' >high assurance authentication?</a>",
    "txtsubTitle2": "What defines \"broader public sector\"?",
    "txtsubcontent4": "Broader Public Sector includes the core provincial public service (ministries), health authorities, Crown corporations, K-12 schools, colleges, institutes, teaching universities, and research universities, contracted social service providers. It does not include Federal, local and municipal governments.",
    "btnLearmore": "Learn more",
    "txtgetStarted": "Get started"
  },
  "testAccountList": {
    "pagetitle": "Load Test Accounts",
    "pageinfo": "<h4>About Virtual Card test accounts</h4><p class=\"my-2\">This form allows you to upload test accounts to the BC Services Card Self-Service application. Users of this application can select one or more test accounts which will be provisioned from this test account pool. Test accounts are allocated discretely to the organization's project and will not be reused between projects.    </p><h4>Adding test accounts to the system</h4><p class=\"my-2\">As an IDIM representative, you are the user that can ensure there is a sufficient supply of virtual cards in this BC Services Card Self-Serve application so that users are not impeded from testing because of a lack of available test accounts.</p><p>To add test accounts, have a CSV file ready with your generated virtual card information in it. </p><ul><li> Copy from your CSV file and paste into the text area below. </li><li> Do not include the heading row which describes the column names.</li></ul>",
    "special_notes": "Paste your CSV in this text box",
    "btnBack": "Go Back",
    "btnSaveChanges": "Load Test Account",
    "errorMessage": "Something went wrong.",
    "successMessage": "Test accounts loaded"
  },
  "projectContainer": {
    "pagetitle": "Summary page",
    "titleDevSummary": "Dev Summary",
    "titleTeamRoles": "Team",
    "titlePrivacy": "Privacy",
    "titleSecurity": "Security",
    "titleComms": "Communications",
    "titleAgreements": "Agreements",
    "titleLiveSummary": "Live Summary"
  },
  "teamRoles": {
    "pagetitle": "Project team roles",
    "pageInfo": "To begin your development, only the Developer is required. To move your project along the route to implementation in a production environment, a Manager and Executive Sponsor will be required.",
    "tblHeadName": "Name",
    "tblHeadMyRole": "Role",
    "tblHeadEmail": "Email",
    "tblHeadPhone": "Work phone",
    "labelRoledeveloper": "Developer",
    "labelRolemanager": "Manager",
    "labelRolecto": "Executive Sponsor",
    "btnAddTeamMember": "+ Add team member",
    "deleteWarning": "You have chosen to remove a user from this project.<br/>Do you wish to proceed with deleting this user?"
  },
  "addTeamMember": {
    "pagetitle": "Add a team member",
    "pagetitleUpdate": "Update a team member",
    "contactInfo": "Contact information",
    "roleTitle": "Role",
    "labelRoledeveloper": "Developer",
    "labelRolemanager": "Manager",
    "labelRolecto": "Executive Sponsor",
    "btnCancel": "Cancel",
    "btnSumbmit": "+ Add user",
    "btnSumbmitSave": "Save",
    "labelFirstName": "First name",
    "labelLastName": "Last name",
    "labelWorkEmail": "Work email",
    "labelPhone": "Office phone number",
    "errorTitle": "Please fix following errors",
    "invalidDomain": "This email domain address you entered is not in our system of approved organizations. Please correct the email address or  <a href='/contact-us'>contact us</a> to have the domain added to the system.",
    "roleAlreadyAssigned": "This role is already assigned to another team member. Please select a different role or <a href='/contact-us'>contact us</a> to change your project team membership.",
    "emailAlreadyAssigned": "The email address you entered belongs to a user who already has been assigned in this project. An individual user can only have one project role.",
    "labelRoleInfodeveloper": "The developer builds the integration with BC Services Card",
    "labelRoleInfomanager": "The manager steers the integration through to production",
    "labelRoleInfocto": "The Executive Sponsor attests to the integration application compliance"
  },
  "projectActions": {
    "btnRequestLiveAccess": "Request live access",
    "requestLiveAccessDialogTitle": "Request live access",
    "requestLiveAccessDialogInfo": "<h3>You have chosen to request live access.</h3><p class='my-5'>This action will move your project into the next phase to begin the Live Access Request process.</p><p class='my-5 pr-2'>In this next phase, you will be guided through the process to understand and address the various categories of compliance before integrating with a live production-ready environment of BC Services Card data. A member of the Provincial Identity Information Management Program is always available to help BPS clients in completing the integration components.</p><p class='my-5'>The Provincial Identity Information Management Program is mandated to provide identity and authentication services using the BC Services Card to support citizen transactions with government services.</p><p class='my-5'><strong> Would you like to continue?</strong></p>",
    "btnCancel": "Cancel",
    "btnConfirm": "Request live access",
    "labelDelete": "Delete project",
    "btnDeleteConfirm": "Delete this project",
    "btnDeleteCancel": "Cancel",
    "deleteDialogTitle": "Delete this project",
    "deleteDialogInfo": "<h3>You have chosen to delete this project</h4><p class='my-5'>Please note:</p><ul><li> Deleting this project will remove both the project and API from the system.</li><li> A project can only be deleted by a member of the project team while it is in the development state.</li><li>  Once you have marked development complete on your project, deletion is no longer possible. If you require a project deleted from this phase, please <a href='/contact-us'>contact us.</a></li></ul><p class='my-5 red--text'>Deleting a project is permanent and cannot be undone.</p><pclass='my-5 '>Do you wish to proceed with deleting this project?</p>"
  }
}
